<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"781a1509ca67087a57c5515c166db7aaedd0f0517f605e3081bb5287c99958ad","plan_job_ref":"Job Create PR TF Plan comment #13 at https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13541624727","plan_out_hash":"7e34b639b5027258118a877555efe1a6de039edc5063431773dad0fceef44453","plan_hash":"bbeb7e780c1168741639d4f9bda90b2dd384d30586efc897479736690cd5b21f","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan in __./tf_restore__
With backend config: `resource_group_name=ClauseFabric storage_account_name=tfsamsfabrictfstate container_name=tfstate key=terraform-msfabric-restore-demo.tfstate`<details open><summary>With variables</summary>

```hcl
admin_user        = (sensitive value)
admin_user2       = (sensitive value)
azeventhub_saskey = (sensitive value)
client_id         = (sensitive value)
client_secret     = (sensitive value)
tenant_id         = (sensitive value)
```
</details>
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # fabric_eventhouse.kql_demo_restore will be created
+   resource "fabric_eventhouse" "kql_demo_restore" {
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "eh-datamonster"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_eventstream.kql_demo_es_restore will be created
+   resource "fabric_eventstream" "kql_demo_es_restore" {
+       definition                = {
+           "eventstream.json" = {
+               source                = "../item-templates/eventstream.json.tmpl"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "ConnId"    = "aafa3c75-e435-4c42-98e1-8bbe1ec68cd8"
+                   "KqlDbId"   = (known after apply)
+                   "KqlDbName" = "kql-db-01-datamonster"
+                   "WsId"      = "e3fc484a-6c6b-424c-808f-83551b6020b1"
                }
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-es-datamonster"
+       format                    = "Default"
+       id                        = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_dashboard.kql_demo_dash_restore will be created
+   resource "fabric_kql_dashboard" "kql_demo_dash_restore" {
+       definition                = {
+           "RealTimeDashboard.json" = {
+               source                = "../item-templates/RealTimeDashboard.json"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlDbId"     = (known after apply)
+                   "QuerySvcUri" = (known after apply)
+                   "WsId"        = "e3fc484a-6c6b-424c-808f-83551b6020b1"
                }
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-dash-datamonster"
+       format                    = "Default"
+       id                        = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_database.kql_demo_db_1_restore will be created
+   resource "fabric_kql_database" "kql_demo_db_1_restore" {
+       definition                = {
+           "DatabaseProperties.json" = {
+               source                = "../item-templates/DatabaseProperties_01.json.tmpl"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlEhId" = (known after apply)
                }
            },
+           "DatabaseSchema.kql" = {
+               source                = "../item-templates/DatabaseSchema_01.kql"
+               source_content_sha256 = "4507ca977dab0e1aa16f205c0d92dafebc96e03e50a0d582a6b3f0120cbc300c"
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-01-datamonster"
+       format                    = "Default"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_database.kql_demo_db_2_restore will be created
+   resource "fabric_kql_database" "kql_demo_db_2_restore" {
+       definition                = {
+           "DatabaseProperties.json" = {
+               source                = "../item-templates/DatabaseProperties_01.json.tmpl"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlEhId" = (known after apply)
                }
            },
+           "DatabaseSchema.kql" = {
+               source                = "../item-templates/DatabaseSchema_02.kql"
+               source_content_sha256 = "6ceb64df2ef8eb9662dbf7723d3148aac56cc11a273e8b047dfa4fbc217f6710"
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-02-datamonster"
+       format                    = "Default"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: 'Eventstream' preview mode

  with fabric_eventstream.kql_demo_es_restore,
  on kql-resources-restore.tf line 51, in resource "fabric_eventstream" "kql_demo_es_restore":
  51: resource "fabric_eventstream" "kql_demo_es_restore" {

The behavior of 'Eventstream' may change in future releases without notice or
backward compatibility.

(and one more similar warning elsewhere)

Warning: Preview mode enabled

  with provider["registry.terraform.io/microsoft/fabric"],
  on provider.tf line 20, in provider "fabric":
  20: provider "fabric" {

Features available in preview mode are not yet generally available and may
change without notice include breaking changes. Production use is not
recommended. Use at your own risk!
```
</details>

:x: Error applying plan in [Terraform CD - Restore #12](https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13541649020)